[
  {
    "idiom_id": 20001,
    "idiom_gurmukhi": "ਉਸ ਪੇਕੇ ਕੀ ਜਾਣਾ ਜਿਥੇ ਸਿਰ ਪਾਣੀ ਨਾ ਪਾਣਾ",
    "idiom_basic_defintion_gurmukhi": "ਪਿੰਡ ਭਾਵੇਂ ਪੇਕਿਆਂ ਦਾ ਹੀ ਹੋਵੇ ਪਰ ਸੁਖ-ਅਰਾਮ ਤੋਂ ਬਗੈਰ ਉਥੇ ਜਾਣਾ ਵੀ ਬੇਕਾਰ ਹੈ।",
    "idiom_shahmukhi": "اوس پِیکے کی جاݨا جِتّھے سِر پاݨی نہ پاوݨا",
    "transliteration_roman_simple": "Us peke ki jaana jithe sir paani na paana",
    "transliteration_roman": "Us peke kī jāṇā jithe sir pāṇī nā pāṇā",
    "definition_shahmukhi": "ایس اکھاݨ دا مطلب ہے کہ بھانویں کوئی تھاں کِنی وی چنگی یا اپنی کیوں نہ ہووے، جِویں کہ ویاہی ہوئی عورت لئی اوہدا پیکا گھر، پر جے اوتھے جا کے عزت، آرام، سُکھ یا بنیادی سہولتاں نہ مِلݨ تاں اوتھے جاݨ دا کوئی فائدہ نہیں۔ 'سِر پاݨی پاوݨا' دا مطلب صرف نہاؤݨا یا سِر 'تے پاݨی پاؤݨا نہیں، بلکہ ایہہ استقبال، عزت، تے آرام دی نشانی ہے۔ جدوں کوئی کہندا اے کہ اوتھے تاں 'سِر پاݨی وی نئیں پاؤندے'، تاں اوہدا مطلب ہوندا اے کہ اوتھے بالکل وی قدر نئیں، کوئی پُچھ گِچھ نئیں، تے کوئی آرام نئیں۔ ایس لئی، ایہہ اکھاݨ زور دیندا اے کہ کسے وی تھاں یا رشتے دی اصل قیمت اوتھے مِلݨ آلے سلوک تے آرام نال ہوندی اے، نہ کہ صرف اوہدے ناں یا ظاہری تعلق نال۔ ایہہ صرف پِیکے جاݨ بارے ای نہیں، بلکہ کسے وی اجیہی صورتحال 'تے لاگو ہوندا اے جتھے متوقع فائدے یا چنگا سلوک موجود نہ ہووے۔",
    "definition_gurmukhi": "ਇਸ ਅਖਾਣ ਦਾ ਭਾਵ ਹੈ ਕਿ ਭਾਵੇਂ ਕੋਈ ਸਥਾਨ ਕਿੰਨਾ ਵੀ ਚੰਗਾ ਜਾਂ ਆਪਣਾ ਕਿਉਂ ਨਾ ਹੋਵੇ, ਜਿਵੇਂ ਕਿ ਵਿਆਹੀ ਹੋਈ ਔਰਤ ਲਈ ਉਸਦਾ ਪੇਕਾ ਘਰ, ਪਰ ਜੇ ਉੱਥੇ ਜਾ ਕੇ ਇੱਜ਼ਤ, ਆਰਾਮ, ਸੁੱਖ ਜਾਂ ਬੁਨਿਆਦੀ ਸਹੂਲਤਾਂ ਨਾ ਮਿਲਣ ਤਾਂ ਉੱਥੇ ਜਾਣ ਦਾ ਕੋਈ ਲਾਭ ਨਹੀਂ। 'ਸਿਰ ਪਾਣੀ ਪਾਉਣਾ' ਦਾ ਸ਼ਾਬਦਿਕ ਅਰਥ ਸਿਰ 'ਤੇ ਪਾਣੀ ਪਾਉਣ ਤੋਂ ਇਲਾਵਾ ਇੱਥੇ ਸਵਾਗਤ, ਆਦਰ-ਮਾਣ, ਅਤੇ ਆਰਾਮ ਦੇਣ ਦੇ ਪ੍ਰਤੀਕ ਵਜੋਂ ਵਰਤਿਆ ਗਿਆ ਹੈ। ਪੁਰਾਣੇ ਸਮਿਆਂ ਵਿੱਚ, ਲੰਬੇ ਸਫ਼ਰ ਤੋਂ ਬਾਅਦ ਆਏ ਮਹਿਮਾਨ ਦੇ ਸਿਰ 'ਤੇ ਪਾਣੀ ਪਾ ਕੇ ਉਸਨੂੰ ਤਰੋ-ਤਾਜ਼ਾ ਕੀਤਾ ਜਾਂਦਾ ਸੀ, ਜੋ ਕਿ ਮੁੱਢਲੀ ਪ੍ਰਾਹੁਣਚਾਰੀ ਦਾ ਹਿੱਸਾ ਸੀ। ਇਸ ਲਈ, ਇਸ ਮੁਹਾਵਰੇ ਦਾ ਅਰਥ ਹੈ ਕਿ ਜਿੱਥੇ ਘੱਟੋ-ਘੱਟ ਆਰਾਮ ਜਾਂ ਆਦਰ-ਸਤਿਕਾਰ ਵੀ ਨਾ ਮਿਲੇ, ਭਾਵੇਂ ਉਹ ਥਾਂ ਆਪਣੀ ਹੀ ਕਿਉਂ ਨਾ ਹੋਵੇ (ਜਿਵੇਂ ਕਿ ਪੇਕੇ), ਉੱਥੇ ਜਾਣ ਦਾ ਕੋਈ ਫਾਇਦਾ ਨਹੀਂ ਹੈ। ਇਹ ਅਖਾਣ ਇਸ ਗੱਲ 'ਤੇ ਜ਼ੋਰ ਦਿੰਦਾ ਹੈ ਕਿ ਕਿਸੇ ਵੀ ਸਥਾਨ ਜਾਂ ਰਿਸ਼ਤੇ ਦੀ ਅਸਲ ਕੀਮਤ ਉੱਥੇ ਮਿਲਣ ਵਾਲੇ ਸਲੂਕ, ਆਰਾਮ ਅਤੇ ਅਪਣੱਤ ਵਿੱਚ ਹੁੰਦੀ ਹੈ, ਨਾ ਕਿ ਸਿਰਫ਼ ਉਸਦੇ ਨਾਮ ਜਾਂ ਰਸਮੀ ਸਬੰਧ ਵਿੱਚ। ਇਹ ਸਿਰਫ਼ ਪੇਕੇ ਜਾਣ ਦੇ ਸੰਦਰਭ ਤੱਕ ਹੀ ਸੀਮਤ ਨਹੀਂ, ਸਗੋਂ ਕਿਸੇ ਵੀ ਅਜਿਹੀ ਸਥਿਤੀ 'ਤੇ ਲਾਗੂ ਹੁੰਦਾ ਹੈ ਜਿੱਥੇ ਉਮੀਦ ਕੀਤੇ ਗਏ ਲਾਭ, ਆਰਾਮ ਜਾਂ ਸਤਿਕਾਰ ਗੈਰਹਾਜ਼ਰ ਹੋਣ।",
    "definition_english": "This idiom translates literally to 'What's the point of going to those parental home (peke) where they don't even pour water on the head?'. The term 'peke' refers to a married woman's parental home, traditionally a place of comfort, pampering, and relaxation in Punjabi culture. 'Sir pāṇī pāṇā' (pouring water on the head) signifies basic hospitality, welcome, and care; historically, it could refer to helping a guest freshen up after a journey, symbolizing respect and attentiveness. Therefore, the idiom means that even a place intrinsically associated with comfort and belonging, like one's own parental home, becomes undesirable if basic respect, hospitality, or comfort is lacking. It emphasizes that the quality of reception and the actual experience of comfort and respect are more important than the mere name, relationship, or formal association of the place. Going somewhere, even if it's 'home,' is futile if one isn't treated well or doesn't find solace there. The idiom is used broadly to comment on any situation—be it a place, a job, or a relationship—where the expected benefits, welcome, or fundamental comforts are absent, rendering the association pointless despite its potential appeal.",
    "western_phrase": [
      "There's no point going where you're not welcome.",
      "It's not worth the trip/effort if the reception is cold.",
      "A house is not always a home.",
      "All that glitters is not gold (if the place/situation seems appealing but lacks substance/welcome).",
      "Why go to a well that has no water?"
    ]
  },
  {
    "idiom_id": 20002,
    "idiom_gurmukhi": "ਉਹ ਕਿਹੜੀ ਗਲੀ, ਜਿੱਥੇ ਭਾਗੋ ਨਹੀ ਖਲੀ",
    "idiom_basic_defintion_gurmukhi": "ਹਰ ਥਾਂ ਖੜਪੈਂਚ/ਚੌਧਰੀ ਬਣਿਆ ਰਹਿਣ ਵਾਲਾ ਆਦਮੀ।",
    "idiom_shahmukhi": "اوہ کیہڑی گلی، جتھے بھاگو نہیں کھلی",
    "transliteration_roman_simple": "Oh kehri gali, jithe Bhago nahi khali",
    "transliteration_roman": "Uh kihṛī galī, jithē Bhāgō nahī khalī",
    "definition_shahmukhi": "ایہہ اکھان اوس بندے لئی ورتیا جاندا اے جیہڑا ہر معاملے وچ دخل دیندا اے، ہر تھاں اپنی چودھر یا موجودگی جتاؤن دی کوشش کردا اے، بھاویں اوہدی لوڑ ہووے یا نہ۔ لفظی مطلب اے \"ایسی کیہڑی گلی اے جتھے بھاگو (اک فرضی ناں) کھلوتی نہیں اے؟\" ایہدا مطلب اے پئی ایہو جیہا بندہ ہر تھاں موجود ہوندا اے، ہر گل وچ اپنی لت اڑاؤندا اے یا بن بلائے ہر جگہ اپڑ جاندا اے۔ ایہہ عام طور تے تھوڑا منفی یا مخولیا لہجے وچ ورتیا جاندا اے کسے ایہو جہے بندے دا بیان کرن لئی جیہڑا ہر تھاں 'تے اپنا اثر پاؤن دی کوشش کردا اے یا ہر گل بات/اکٹھ دا حصہ بننا چاہندا اے۔ 'بھاگو' ایتھے اک عام علامتی ناں اے جیہڑا ایسے بندے دی نشاندہی کردا اے۔",
    "definition_gurmukhi": "ਇਹ ਅਖਾਣ ਉਸ ਵਿਅਕਤੀ ਲਈ ਵਰਤਿਆ ਜਾਂਦਾ ਹੈ ਜੋ ਹਰ ਮਾਮਲੇ ਵਿੱਚ ਦਖਲਅੰਦਾਜ਼ੀ ਕਰਦਾ ਹੈ, ਹਰ ਥਾਂ ਆਪਣੀ ਚੌਧਰ ਜਾਂ ਮੌਜੂਦਗੀ ਜਤਾਉਣ ਦੀ ਕੋਸ਼ਿਸ਼ ਕਰਦਾ ਹੈ, ਭਾਵੇਂ ਉਸਦੀ ਲੋੜ ਹੋਵੇ ਜਾਂ ਨਾ। ਸ਼ਾਬਦਿਕ ਅਰਥ ਹੈ \"ਅਜਿਹੀ ਕਿਹੜੀ ਗਲੀ ਹੈ ਜਿੱਥੇ ਭਾਗੋ (ਇੱਕ ਕਾਲਪਨਿਕ/ਪ੍ਰਤੀਕਾਤਮਕ ਨਾਮ) ਖੜੀ ਨਹੀਂ ਹੈ?\" ਇਸਦਾ ਭਾਵ ਹੈ ਕਿ ਅਜਿਹਾ ਵਿਅਕਤੀ ਹਰ ਥਾਂ ਮੌਜੂਦ ਹੁੰਦਾ ਹੈ, ਹਰ ਗੱਲ ਵਿੱਚ ਆਪਣੀ ਲੱਤ ਅੜਾਉਂਦਾ ਹੈ ਜਾਂ ਬਿਨਾਂ ਬੁਲਾਏ ਹਰ ਥਾਂ ਪਹੁੰਚ ਜਾਂਦਾ ਹੈ। ਇਹ ਆਮ ਤੌਰ 'ਤੇ ਥੋੜ੍ਹਾ ਨਕਾਰਾਤਮਕ ਜਾਂ ਮਜ਼ਾਕੀਆ ਲਹਿਜੇ ਵਿੱਚ ਵਰਤਿਆ ਜਾਂਦਾ ਹੈ ਕਿਸੇ ਅਜਿਹੇ ਵਿਅਕਤੀ ਦਾ ਵਰਣਨ ਕਰਨ ਲਈ ਜੋ ਹਰ ਥਾਂ 'ਤੇ ਆਪਣਾ ਪ੍ਰਭਾਵ ਪਾਉਣ ਦੀ ਕੋਸ਼ਿਸ਼ ਕਰਦਾ ਹੈ ਜਾਂ ਹਰ ਗੱਲਬਾਤ/ਸਮਾਗਮ ਦਾ ਹਿੱਸਾ ਬਣਨਾ ਚਾਹੁੰਦਾ ਹੈ। 'ਭਾਗੋ' ਇੱਥੇ ਇੱਕ ਆਮ ਪ੍ਰਤੀਕਾਤਮਕ ਨਾਮ ਹੈ ਜੋ ਅਜਿਹੇ ਵਿਅਕਤੀ ਨੂੰ ਦਰਸਾਉਂਦਾ ਹੈ।",
    "definition_english": "This proverb is used for a person who interferes in every matter and tries to assert their authority ('Chaudhar') or presence everywhere, whether needed or not. Literally, it translates to \"Which street is that, where Bhago (a symbolic name, often female but used generically for a person) hasn't stood?\" Figuratively, it implies that such a person is omnipresent, pokes their nose into everything ('har gal vich apni latt aṛāuṇā' - idiomatically: trips things up in every matter), or shows up everywhere, often uninvited. It's generally used in a slightly negative or teasing tone to describe someone perceived as meddlesome, a busybody, or someone who tries to be influential or involved in every situation, conversation, or gathering. 'Bhago' serves as a generic, symbolic name representing such an individual, highlighting their ubiquity.",
    "western_phrase": [
      "To have a finger in every pie",
      "He/She gets everywhere",
      "Busybody",
      "Nosy Parker",
      "To poke one's nose into everything"
    ]
  },
  {
    "idiom_id": 20003,
    "idiom_gurmukhi": "ਉਹ ਜ਼ਮੀਨ ਰਾਣੀ ਜਿਸ ਦੇ ਸਿਰ ‘ਤੇ ਪਾਣੀ",
    "idiom_basic_defintion_gurmukhi": "ਜਿਸ ਜ਼ਮੀਨ ਨੂੰ ਪਾਣੀ ਲੱਗਦਾ ਹੋਵੇ ਉਹ ਉਪਜਾਊ ਹੁੰਦੀ ਹੈ।",
    "idiom_shahmukhi": "اوہ زمین رانی جس دے سِر ‘تے پانی",
    "transliteration_roman_simple": "Uh zameen rani jis de sir te pani",
    "transliteration_roman": "Uh zamīn rāṇī jis de sir ‘te pāṇī",
    "definition_shahmukhi": "ایس اکھان دا بھاو ہے کہ جس زمین نُوں سنچائی لئی پانی دی سہولت اُپلَبدھ ہووے، اوہ بہت اُپجاؤ، قیمتی اتے لابھکاری ہوندی ہے۔ اجیہی زمین نُوں 'رانی' کہہ کے اوسدی مہتتا اتے سرووتمتا نُوں درسایا گیا ہے۔ پنجاب دے کھیتی باڑی پردھان سبھیاچار وِچ، پانی جیون-داتا ہے اتے زمین دی اُپجاؤ شکتی دا مُکھ ادھار ہے۔ ایس لئی، چنگی سنچائی والی زمین سبھ توں ودھ لوڑِیندی اتے ستکاری جاندی ہے۔ النکارک طور 'تے، ایہہ اکھان کسے وی ستھتی 'تے لاگو ہو سکدا ہے جتھے ضروری سروتاں (جیویں پانی) دی موجودگی کسے چیز یاں ویکتی دی سفلتا، مُلّ اتے اُتپادکتا نُوں یقینی بݨاؤندی ہے۔",
    "definition_gurmukhi": "ਇਸ ਅਖਾਣ ਦਾ ਭਾਵ ਹੈ ਕਿ ਜਿਸ ਜ਼ਮੀਨ ਨੂੰ ਸਿੰਚਾਈ ਲਈ ਪਾਣੀ ਦੀ ਸਹੂਲਤ ਉਪਲਬਧ ਹੋਵੇ, ਉਹ ਬਹੁਤ ਉਪਜਾਊ, ਕੀਮਤੀ ਅਤੇ ਲਾਭਕਾਰੀ ਹੁੰਦੀ ਹੈ। ਅਜਿਹੀ ਜ਼ਮੀਨ ਨੂੰ 'ਰਾਣੀ' ਕਹਿ ਕੇ ਉਸਦੀ ਮਹੱਤਤਾ ਅਤੇ ਸਰਵੋਤਮਤਾ ਨੂੰ ਦਰਸਾਇਆ ਗਿਆ ਹੈ। ਪੰਜਾਬ ਦੇ ਖੇਤੀਬਾੜੀ ਪ੍ਰਧਾਨ ਸਭਿਆਚਾਰ ਵਿੱਚ, ਪਾਣੀ ਜੀਵਨ-ਦਾਤਾ ਹੈ ਅਤੇ ਜ਼ਮੀਨ ਦੀ ਉਪਜਾਊ ਸ਼ਕਤੀ ਦਾ ਮੁੱਖ ਅਧਾਰ ਹੈ। ਇਸ ਲਈ, ਚੰਗੀ ਸਿੰਚਾਈ ਵਾਲੀ ਜ਼ਮੀਨ ਸਭ ਤੋਂ ਵੱਧ ਲੋੜੀਂਦੀ ਅਤੇ ਸਤਿਕਾਰੀ ਜਾਂਦੀ ਹੈ। ਅਲੰਕਾਰਿਕ ਤੌਰ 'ਤੇ, ਇਹ ਅਖਾਣ ਕਿਸੇ ਵੀ ਸਥਿਤੀ 'ਤੇ ਲਾਗੂ ਹੋ ਸਕਦਾ ਹੈ ਜਿੱਥੇ ਜ਼ਰੂਰੀ ਸਰੋਤਾਂ (ਜਿਵੇਂ ਪਾਣੀ) ਦੀ ਮੌਜੂਦਗੀ ਕਿਸੇ ਚੀਜ਼ ਜਾਂ ਵਿਅਕਤੀ ਦੀ ਸਫਲਤਾ, ਮੁੱਲ ਅਤੇ ਉਤਪਾਦਕਤਾ ਨੂੰ ਯਕੀਨੀ ਬਣਾਉਂਦੀ ਹੈ।",
    "definition_english": "This idiom signifies that land which has access to water for irrigation is highly fertile, valuable, and productive. Personifying such land as a 'queen' emphasizes its supreme importance and desirability. In the agrarian culture of Punjab, water is life-sustaining and the primary determinant of land's fertility and yield. Therefore, well-irrigated land is considered the most valuable and esteemed asset. Metaphorically, the saying can extend to any context where the availability of a crucial resource (like 'water' for land) guarantees the success, value, and productivity of an entity, project, or even a person. The phrase 'water on its head' implies direct, readily available, and sufficient water supply.",
    "western_phrase": [
      "The lifeblood of...",
      "Location, location, location (regarding a key factor determining value)",
      "Well-resourced",
      "Sitting pretty (implying having necessary advantages/resources)"
    ]
  },
  {
    "idiom_id": 20004,
    "idiom_gurmukhi": "ਉਹ ਦਿਨ ਡੁੱਬਾ, ਜਦ ਘੋੜੀ ਚੜ੍ਹਿਆ ਕੁੱਬਾ",
    "idiom_basic_defintion_gurmukhi": "ਨਕਾਰੇ ਆਦਮੀ ਤੋਂ ਵੱਡੇ ਕੰਮ ਦੀ ਆਸ ਨਹੀਂ ਰੱਖੀਦੀ।",
    "idiom_shahmukhi": "اوہ دِن ڈُبّا، جد گھوڑی چڑھیا کُبّا",
    "transliteration_roman_simple": "Oh din dubba, jad ghori charhia kubba",
    "transliteration_roman": "Oh din ḍubbā, jad ghōṛī chaṛhiā kubbā",
    "definition_shahmukhi": "ایس اکھان دا مطلب اے کہ جس دِن کوئی نالائق، نکما یا نااہل بندہ کسے وڈے یا اہم کم دی ذمےواری چک لیندا اے، اوس دن اوس کم دا بیڑا غرق ہو جاندا اے یا اوہ کم ناکام ہو جاندا اے۔ ایتھے 'کُبّا' نااہلیت یا کمزوری دی علامت اے تے 'گھوڑی چڑھنا' کسے اہم مہم، ذمہ داری یا کم شروع کرن دی علامت اے۔ ایہہ اکھان اوس ویلے ورتیا جاندا اے جدوں کسے نااہل بندے نُوں اوہدی قابلیت توں ودھ کم سونپ دِتا جاوے تے پہلاں توں ای اندازہ ہووے کہ نتیجہ بھیڑا ای نکلے گا۔ ایہہ ایس سماجی سچائی نُوں بیان کردا اے کہ وڈے کمّاں واسطے قابلیت ضروری اے تے نااہل بندے توں کامیابی دی امید رکھنا فضول اے۔",
    "definition_gurmukhi": "ਇਸ ਮੁਹਾਵਰੇ ਦਾ ਭਾਵ ਹੈ ਕਿ ਜਿਸ ਦਿਨ ਕੋਈ ਅਯੋਗ, ਨਿਕੰਮਾ ਜਾਂ ਨਾ-ਕਾਬਲ ਵਿਅਕਤੀ ਕਿਸੇ ਵੱਡੇ ਜਾਂ ਮਹੱਤਵਪੂਰਨ ਕੰਮ ਦੀ ਜ਼ਿੰਮੇਵਾਰੀ ਸੰਭਾਲ ਲੈਂਦਾ ਹੈ, ਉਸ ਦਿਨ ਉਸ ਕੰਮ ਦਾ ਬੇੜਾ ਗਰਕ ਹੋ ਜਾਂਦਾ ਹੈ ਜਾਂ ਉਹ ਕੰਮ ਅਸਫਲ ਹੋ ਜਾਂਦਾ ਹੈ। ਇੱਥੇ 'ਕੁੱਬਾ' (hunchback) ਅਯੋਗਤਾ ਜਾਂ ਕਮਜ਼ੋਰੀ ਦਾ ਪ੍ਰਤੀਕ ਹੈ ਅਤੇ 'ਘੋੜੀ ਚੜ੍ਹਨਾ' ਕਿਸੇ ਮਹੱਤਵਪੂਰਨ ਮੁਹਿੰਮ, ਜ਼ਿੰਮੇਵਾਰੀ ਜਾਂ ਕਾਰਜ ਨੂੰ ਸ਼ੁਰੂ ਕਰਨ ਦਾ ਪ੍ਰਤੀਕ ਹੈ। ਇਹ ਮੁਹਾਵਰਾ ਉਦੋਂ ਵਰਤਿਆ ਜਾਂਦਾ ਹੈ ਜਦੋਂ ਕਿਸੇ ਅਜਿਹੇ ਵਿਅਕਤੀ ਨੂੰ ਕੋਈ ਕੰਮ ਸੌਂਪਿਆ ਜਾਂਦਾ ਹੈ ਜੋ ਉਸਦੀ ਯੋਗਤਾ ਤੋਂ ਪਰੇ ਹੋਵੇ, ਅਤੇ ਪਹਿਲਾਂ ਤੋਂ ਹੀ ਇਹ ਸਪੱਸ਼ਟ ਹੋਵੇ ਕਿ ਨਤੀਜਾ ਮਾੜਾ ਹੀ ਨਿਕਲੇਗਾ। ਇਹ ਇਸ ਸਮਾਜਿਕ ਸੱਚਾਈ ਨੂੰ ਦਰਸਾਉਂਦਾ ਹੈ ਕਿ ਵੱਡੇ ਕੰਮਾਂ ਲਈ ਯੋਗਤਾ ਜ਼ਰੂਰੀ ਹੈ ਅਤੇ ਅਯੋਗ ਵਿਅਕਤੀ ਤੋਂ ਸਫਲਤਾ ਦੀ ਆਸ ਰੱਖਣਾ ਵਿਅਰਥ ਹੈ।",
    "definition_english": "Literally translates to 'That day sank (was doomed) when the hunchback mounted the mare.' The idiom signifies that disaster or failure is inevitable when an incapable, incompetent, or unsuitable person takes charge of or attempts a significant and demanding task. The 'hunchback' (ਕੁੱਬਾ / کُبّا - kubbā) serves as a metaphor for ineptitude or unsuitability, while 'mounting the mare' (ਘੋੜੀ ਚੜ੍ਹਨਾ / گھوڑی چڑھنا - ghōṛī chaṛhnā) symbolizes undertaking a major responsibility, challenge, or important event (like going to battle or a groom riding in his wedding procession). It is used to express pessimism or criticism when someone clearly unqualified is assigned a task far exceeding their abilities, implying that the negative outcome is almost predetermined. It reflects the pragmatic understanding that competence is essential for success in important endeavors, and expecting positive results from someone unfit for the job is futile.",
    "western_phrase": [
      "Putting the fox in charge of the henhouse.",
      "Sending a boy to do a man's job.",
      "You can't make a silk purse out of a sow's ear.",
      "A recipe for disaster.",
      "Setting someone up for failure."
    ]
  },
  {
    "idiom_id": 20005,
    "idiom_gurmukhi": "ਉਹ ਨਾ ਭੁੱਲਾ ਜਾਣੀਏ, ਜੋ ਮੁੜ ਘਰ ਆਵੇ",
    "idiom_basic_defintion_gurmukhi": "ਜਦ ਕੋਈ ਗਲਤੀ ਕਰ ਕੇ ਛੇਤੀ ਹੀ ਮਾਫ਼ੀ ਮੰਗ ਲਵੇ ਤੇ ਸੰਭਾਲ ਜਾਵੇ।",
    "idiom_shahmukhi": "اوہ نہ بُھلّا جانیئے، جو مُڑ گھر آوے",
    "transliteration_roman_simple": "Oh Na Bhulla Janie, Jo Mur Ghar Aave",
    "transliteration_roman": "Uh nā bhullā jāṇīe, jo muṛ ghar āve",
    "definition_shahmukhi": "ایہہ اکھان شابْدِک طور تے کہندا ہے کہ اوس بندے نُوں گواچیا یاں بھٹکیا نہیں سمجھنا چاہیدا جو واپس اپنے گھر آ جاندا ہے۔ ایہدا مطلب بہوں ڈونگھا ہے۔ ایہہ اوس حالت نُوں دَکھاؤندا ہے جتھے کوئی بندہ کوئی غلطی کردا ہے، کُراہے پیندا ہے، یاں کوئی غلط کم کردا ہے، پر فیر اپنی غلطی نُوں محسوس کرکے صحیح راہ تے واپس آ جاندا ہے یاں معافی منگ لیندا ہے۔ 'گھر آؤنا' ایتھے صرف جسمانی واپسی نہیں، سگوں صحیح راہ، ٹبر، سماج یاں اخلاقی قدراں قیمتاں وَل واپسی دا نشان ہے۔ ایہہ اکھان معافی، سُدھار اتے دوجے موقعے دی اہمیت تے زور دیندا ہے۔ ایہہ سکھاؤندا ہے کہ کسے دی تھوڑ چِری بُھل دے آدھار تے اوس نُوں پੱਕے طور تے بُرا نہیں سمجھنا چاہیدا، خاص کرکے جے اوہ پچھتاوا وکھاؤندا ہے اَتے سُدھر جاندا ہے۔ ایہہ اکثر اُدوں ورتیا جاندا ہے جدوں کسے نُوں تسلی دینی ہووے جیہدا کوئی اپنا غلطی کرکے دُور ہو گیا سی پر ہُن واپس آ گیا ہے، یاں جدوں کسے بھُلݨ والے بندے لئی نرمی وکھاؤنی ہووے جو اپنی غلطی سُدھار لیندا ہے۔",
    "definition_gurmukhi": "ਇਹ ਅਖਾਣ ਸ਼ਾਬਦਿਕ ਤੌਰ 'ਤੇ ਕਹਿੰਦਾ ਹੈ ਕਿ ਉਸ ਵਿਅਕਤੀ ਨੂੰ ਗੁਆਚਿਆ ਜਾਂ ਭਟਕਿਆ ਨਹੀਂ ਸਮਝਣਾ ਚਾਹੀਦਾ ਜੋ ਵਾਪਸ ਆਪਣੇ ਘਰ ਆ ਜਾਂਦਾ ਹੈ। ਇਸਦਾ ਭਾਵ ਅਰਥ ਵਧੇਰੇ ਡੂੰਘਾ ਹੈ। ਇਹ ਉਸ ਸਥਿਤੀ ਨੂੰ ਦਰਸਾਉਂਦਾ ਹੈ ਜਿੱਥੇ ਕੋਈ ਵਿਅਕਤੀ ਕੋਈ ਗਲਤੀ ਕਰਦਾ ਹੈ, ਕੁਰਾਹੇ ਪੈਂਦਾ ਹੈ, ਜਾਂ ਕੋਈ ਗਲਤ ਕੰਮ ਕਰਦਾ ਹੈ, ਪਰ ਫਿਰ ਆਪਣੀ ਗਲਤੀ ਨੂੰ ਮਹਿਸੂਸ ਕਰਕੇ ਸਹੀ ਰਸਤੇ 'ਤੇ ਵਾਪਸ ਆ ਜਾਂਦਾ ਹੈ ਜਾਂ ਮੁਆਫੀ ਮੰਗ ਲੈਂਦਾ ਹੈ। 'ਘਰ ਆਉਣਾ' ਇੱਥੇ ਸਿਰਫ਼ ਭੌਤਿਕ ਵਾਪਸੀ ਨਹੀਂ, ਸਗੋਂ ਸਹੀ ਮਾਰਗ, ਪਰਿਵਾਰ, ਸਮਾਜ ਜਾਂ ਨੈਤਿਕ ਕਦਰਾਂ-ਕੀਮਤਾਂ ਵੱਲ ਵਾਪਸੀ ਦਾ ਪ੍ਰਤੀਕ ਹੈ। ਇਹ ਅਖਾਣ ਮੁਆਫ਼ੀ, ਸੁਧਾਰ ਅਤੇ ਦੂਜੇ ਮੌਕੇ ਦੀ ਮਹੱਤਤਾ 'ਤੇ ਜ਼ੋਰ ਦਿੰਦਾ ਹੈ। ਇਹ ਸਿਖਾਉਂਦਾ ਹੈ ਕਿ ਕਿਸੇ ਦੀ ਅਸਥਾਈ ਭੁੱਲ ਦੇ ਆਧਾਰ 'ਤੇ ਉਸਨੂੰ ਪੱਕੇ ਤੌਰ 'ਤੇ ਬੁਰਾ ਨਹੀਂ ਸਮਝਣਾ ਚਾਹੀਦਾ, ਖਾਸ ਕਰਕੇ ਜੇ ਉਹ ਪਛਤਾਵਾ ਦਿਖਾਉਂਦਾ ਹੈ ਅਤੇ ਸੁਧਰ ਜਾਂਦਾ ਹੈ। ਇਹ ਅਕਸਰ ਉਦੋਂ ਵਰਤਿਆ ਜਾਂਦਾ ਹੈ ਜਦੋਂ ਕਿਸੇ ਨੂੰ ਤਸੱਲੀ ਦੇਣੀ ਹੋਵੇ ਜਿਸਦਾ ਕੋਈ ਆਪਣਾ ਗਲਤੀ ਕਰਕੇ ਦੂਰ ਹੋ ਗਿਆ ਸੀ ਪਰ ਹੁਣ ਵਾਪਸ ਆ ਗਿਆ ਹੈ, ਜਾਂ ਜਦੋਂ ਕਿਸੇ ਭੁੱਲਣਹਾਰ ਵਿਅਕਤੀ ਲਈ ਨਰਮੀ ਦਿਖਾਉਣੀ ਹੋਵੇ ਜੋ ਆਪਣੀ ਗਲਤੀ ਸੁਧਾਰ ਲੈਂਦਾ ਹੈ।",
    "definition_english": "Literally translating to \"He/She should not be considered lost/astray who returns home again,\" this idiom conveys a message of forgiveness and redemption. The basic definition points to someone who makes a mistake but quickly apologizes and corrects their course. More broadly, it signifies that a person who deviates, makes an error, or goes down the wrong path should not be permanently judged or written off if they eventually realize their mistake and return to the right way, seek forgiveness, or make amends. 'Returning home' is symbolic, representing not just a physical return but also a return to correct principles, family values, community norms, or moral standing. The idiom emphasizes the importance of second chances and the idea that a lapse in judgment doesn't define a person forever, especially if they demonstrate remorse and rectify their actions. It is often used to comfort someone whose relation or friend has returned after straying, or to express leniency towards someone who acknowledges and corrects their fault.",
    "western_phrase": [
      "The return of the prodigal son (Biblical parable, strong conceptual overlap)",
      "Let bygones be bygones",
      "All is forgiven",
      "To err is human, to forgive divine",
      "Turn over a new leaf",
      "Welcome back (in the context of returning after an error)"
    ]
  }
]