[
  {
    "id": 100009,
    "phrase_id": 300001,
    "phrase_gurmukhi": "ਅਕਲ ਤੇ ਪੜਦਾ ਪੈਣਾ",
    "synonyms_gurmukhi": "ਅਕਲ ਮਾਰੀ ਜਾਣੀ",
    "phrase_shahmukhi": "عقل تے پردہ پَینا",
    "definition_english": "to be confused, baffled, bemused; muddled, obfuscated, stupefied",
    "phrase_roman": "akal te parhda paina",
    "phrase_roman_diacritics": "akal tē paṛdā paiṇā",
    "grammar": "phrase",
    "definition_gurmukhi": "ਇਹ ਮੁਹਾਵਰਾ 'ਅਕਲ ਤੇ ਪੜਦਾ ਪੈਣਾ' ਉਦੋਂ ਵਰਤਿਆ ਜਾਂਦਾ ਹੈ ਜਦੋਂ ਕੋਈ ਵਿਅਕਤੀ ਕਿਸੇ ਕਾਰਨ ਕਰਕੇ ਆਪਣੀ ਬੁੱਧੀ ਜਾਂ ਸੋਚਣ ਸ਼ਕਤੀ ਦਾ ਸਹੀ ਇਸਤੇਮਾਲ ਨਹੀਂ ਕਰ ਪਾ ਰਿਹਾ ਹੁੰਦਾ। ਅਕਲ ਦਾ ਮਤਲਬ ਹੈ ਬੁੱਧੀ ਜਾਂ ਸਮਝ, ਅਤੇ ਪੜਦਾ ਦਾ ਮਤਲਬ ਹੈ ਪਰਦਾ ਜਾਂ ਰੁਕਾਵਟ। ਇਸ ਦਾ ਸ਼ਾਬਦਿਕ ਅਰਥ ਹੈ ਬੁੱਧੀ ਉੱਤੇ ਪਰਦਾ ਪੈ ਜਾਣਾ, ਭਾਵ ਸੋਚਣ ਸ਼ਕਤੀ ਦਾ ਧੁੰਦਲਾ ਪੈ ਜਾਣਾ ਜਾਂ ਰੁਕ ਜਾਣਾ। ਇਹ ਦਰਸਾਉਂਦਾ ਹੈ ਕਿ ਵਿਅਕਤੀ ਹੈਰਾਨੀ, ਪ੍ਰੇਸ਼ਾਨੀ, ਡਰ, ਜਾਂ ਕਿਸੇ ਹੋਰ ਮਾਨਸਿਕ ਅਵਸਥਾ ਕਾਰਨ ਸਹੀ ਢੰਗ ਨਾਲ ਸੋਚਣ, ਸਮਝਣ ਜਾਂ ਫ਼ੈਸਲਾ ਲੈਣ ਵਿੱਚ ਅਸਮਰੱਥ ਹੋ ਗਿਆ ਹੈ। ਇਹ ਅਕਸਰ ਉਦੋਂ ਕਿਹਾ ਜਾਂਦਾ ਹੈ ਜਦੋਂ ਕੋਈ ਸਾਹਮਣੇ ਪਈ ਸੌਖੀ ਗੱਲ ਨੂੰ ਵੀ ਨਹੀਂ ਸਮਝ ਪਾਉਂਦਾ ਜਾਂ ਮੂਰਖਤਾ ਵਾਲੇ ਫ਼ੈਸਲੇ ਲੈਂਦਾ ਹੈ, ਜਿਵੇਂ ਉਸਦੀ ਅਕਲ ਉੱਤੇ ਕੋਈ ਪਰਦਾ ਪੈ ਗਿਆ ਹੋਵੇ ਜਿਸ ਕਾਰਨ ਉਹ ਸਹੀ ਵੇਖ ਜਾਂ ਸੋਚ ਨਹੀਂ ਸਕਦਾ। ਇਹ ਸਥਿਤੀ ਅਸਥਾਈ ਜਾਂ ਕਈ ਵਾਰ ਕਿਸੇ ਖਾਸ ਮਾਮਲੇ ਲਈ ਵੀ ਹੋ ਸਕਦੀ ਹੈ।",
    "sound": "/wp-content/uploads/sound/akal_pe_parda_paina.mp3",
    "source": "Punjabi University Patiala",
    "g_enriched_definition_gurmukhi": "ਇਹ ਮੁਹਾਵਰਾ 'ਅਕਲ ਤੇ ਪੜਦਾ ਪੈਣਾ' ਉਦੋਂ ਵਰਤਿਆ ਜਾਂਦਾ ਹੈ ਜਦੋਂ ਕੋਈ ਵਿਅਕਤੀ ਕਿਸੇ ਕਾਰਨ ਕਰਕੇ ਆਪਣੀ ਬੁੱਧੀ ਜਾਂ ਸੋਚਣ ਸ਼ਕਤੀ ਦਾ ਸਹੀ ਇਸਤੇਮਾਲ ਨਹੀਂ ਕਰ ਪਾ ਰਿਹਾ ਹੁੰਦਾ। ਅਕਲ ਦਾ ਮਤਲਬ ਹੈ ਬੁੱਧੀ ਜਾਂ ਸਮਝ, ਅਤੇ ਪੜਦਾ ਦਾ ਮਤਲਬ ਹੈ ਪਰਦਾ ਜਾਂ ਰੁਕਾਵਟ। ਇਸ ਦਾ ਸ਼ਾਬਦਿਕ ਅਰਥ ਹੈ ਬੁੱਧੀ ਉੱਤੇ ਪਰਦਾ ਪੈ ਜਾਣਾ, ਭਾਵ ਸੋਚਣ ਸ਼ਕਤੀ ਦਾ ਧੁੰਦਲਾ ਪੈ ਜਾਣਾ ਜਾਂ ਰੁਕ ਜਾਣਾ। ਇਹ ਦਰਸਾਉਂਦਾ ਹੈ ਕਿ ਵਿਅਕਤੀ ਹੈਰਾਨੀ, ਪ੍ਰੇਸ਼ਾਨੀ, ਡਰ, ਜਾਂ ਕਿਸੇ ਹੋਰ ਮਾਨਸਿਕ ਅਵਸਥਾ ਕਾਰਨ ਸਹੀ ਢੰਗ ਨਾਲ ਸੋਚਣ, ਸਮਝਣ ਜਾਂ ਫ਼ੈਸਲਾ ਲੈਣ ਵਿੱਚ ਅਸਮਰੱਥ ਹੋ ਗਿਆ ਹੈ। ਇਹ ਅਕਸਰ ਉਦੋਂ ਕਿਹਾ ਜਾਂਦਾ ਹੈ ਜਦੋਂ ਕੋਈ ਸਾਹਮਣੇ ਪਈ ਸੌਖੀ ਗੱਲ ਨੂੰ ਵੀ ਨਹੀਂ ਸਮਝ ਪਾਉਂਦਾ ਜਾਂ ਮੂਰਖਤਾ ਵਾਲੇ ਫ਼ੈਸਲੇ ਲੈਂਦਾ ਹੈ, ਜਿਵੇਂ ਉਸਦੀ ਅਕਲ ਉੱਤੇ ਕੋਈ ਪਰਦਾ ਪੈ ਗਿਆ ਹੋਵੇ ਜਿਸ ਕਾਰਨ ਉਹ ਸਹੀ ਵੇਖ ਜਾਂ ਸੋਚ ਨਹੀਂ ਸਕਦਾ। ਇਹ ਸਥਿਤੀ ਅਸਥਾਈ ਜਾਂ ਕਈ ਵਾਰ ਕਿਸੇ ਖਾਸ ਮਾਮਲੇ ਲਈ ਵੀ ਹੋ ਸਕਦੀ ਹੈ।",
    "g_example_sentence_gurmukhi": "ਮੈਂ ਉਸਨੂੰ ਏਨਾ ਸੌਖਾ ਸਵਾਲ ਪੁੱਛਿਆ, ਪਰ ਪਤਾ ਨਹੀਂ ਉਸਦੀ ਅਕਲ ਤੇ ਕੀ ਪੜਦਾ ਪੈ ਗਿਆ, ਉਸਨੂੰ ਕੁਝ ਸਮਝ ਹੀ ਨਾ ਆਵੇ।",
    "g_enriched_definition_english": "This idiom, 'Akal te parda paina', literally translates to 'a curtain falling upon the intellect'. It is used to describe a state where a person is unable to use their intellect, reason, or understanding properly due to some cause. The 'curtain' symbolizes an obstruction, a veil, or a blockage that prevents clear thinking. It signifies that the person is confused, baffled, muddled, or incapable of understanding something simple or making a sensible decision, as if their mind has become obscured. This can happen due to shock, surprise, fear, stress, or simply a momentary lapse in judgment or understanding. It often expresses a degree of surprise or frustration that someone, who should be able to understand or reason, is failing to do so. English equivalents or related phrases could include: 'To have one's mind go blank', 'To be completely stumped', 'To have a mental block', 'To be utterly confused', 'To be unable to think straight', or even metaphorically, 'To have a fog descend on one's mind'.",
    "g_enriched_definition_shahmukhi": "ایہہ محاورہ 'عقل تے پردہ پینا' اوس ویلے ورتیا جاندا اے جدوں کوئی بندہ کسے کارن کر کے اپنی عقل یا سوچن شکتی دا صحیح استعمال نہیں کر پا رہیا ہوندا۔ عقل دا مطلب اے بدھی یا سمجھ، اتے پردہ دا مطلب اے پردہ یا رکاوٹ۔ ایدا لفظی مطلب اے بدھی اتے پردہ پے جانا، یعنی سوچن شکتی دا دھندلا پے جانا یا رک جانا۔ ایہہ دسدا اے پئی بندہ حیرانی، پریشانی، ڈر، یا کسے ہور دماغی حالت کر کے صحیح طریقے نال سوچن، سمجھن یا فیصلہ لین وچ اَسمَرتھ ہو گیا اے۔ ایہہ اکثر اوس ویلے کہیا جاندا اے جدوں کوئی سامنے پئی سوکھی گل نوں وی نہیں سمجھ پاندا یا مورکھتا والے فیصلے لیندا اے، جیویں اودی عقل اتے کوئی پردہ پے گیا ہووے جس کارن اوہ صحیح ویکھ یا سوچ نہیں سکدا۔ ایہہ حالت عارضی یا کئی وار کسے خاص معاملے لئی وی ہو سکدی اے۔"
  },
  {
    "id": 100010,
    "phrase_id": 300002,
    "phrase_gurmukhi": "ਅਕਲ ਦਾ ਅੰਨ੍ਹਾ",
    "synonyms_gurmukhi": "ਅਕਲ ਦਾ ਦੁਸ਼ਮਨ, ਅਕਲ ਦਾ ਵੈਰੀ",
    "phrase_shahmukhi": "عقل دا انھا عقل دا دُشمن عقل دا ویری",
    "definition_english": "stupid, foolish, muddle-headed",
    "phrase_roman": "akal da annha akal da dushman akal da vairi",
    "phrase_roman_diacritics": "akal dā annhā akal dā duśman akal dā vairī",
    "grammar": "phrase",
    "definition_gurmukhi": "ਇਹ ਮੁਹਾਵਰਾ ਸ਼ਾਬਦਿਕ ਅਰਥਾਂ ਵਿੱਚ 'ਅਕਲ ਦਾ ਅੰਨ੍ਹਾ' ਭਾਵ ਬੁੱਧੀ ਜਾਂ ਸਮਝ ਪੱਖੋਂ ਅੰਨ੍ਹਾ ਹੋਣਾ ਦੱਸਦਾ ਹੈ। ਇਸਦਾ ਭਾਵ ਹੈ ਉਹ ਵਿਅਕਤੀ ਜਿਸ ਵਿੱਚ ਸੋਚਣ, ਸਮਝਣ ਅਤੇ ਸਹੀ ਨਿਰਣੇ ਲੈਣ ਦੀ ਸ਼ਕਤੀ ਦੀ ਘਾਟ ਹੋਵੇ। ਇਹ ਕਿਸੇ ਅਜਿਹੇ ਬੰਦੇ ਲਈ ਵਰਤਿਆ ਜਾਂਦਾ ਹੈ ਜੋ ਆਸਾਨੀ ਨਾਲ ਸਮਝ ਆਉਣ ਵਾਲੀਆਂ ਗੱਲਾਂ ਨੂੰ ਵੀ ਨਹੀਂ ਸਮਝਦਾ, ਮੂਰਖਤਾ ਭਰੇ ਕੰਮ ਕਰਦਾ ਹੈ, ਜਾਂ ਗਲਤ ਫੈਸਲੇ ਲੈਂਦਾ ਹੈ ਜਦੋਂ ਕਿ ਸਹੀ ਰਸਤਾ ਸਪੱਸ਼ਟ ਹੋਵੇ। ਇਹ ਸ਼ਬਦ ਆਮ ਤੌਰ 'ਤੇ ਨਕਾਰਾਤਮਕ ਤੌਰ 'ਤੇ ਵਰਤਿਆ ਜਾਂਦਾ ਹੈ ਅਤੇ ਕਿਸੇ ਦੀ ਬੇਵਕੂਫੀ ਜਾਂ ਨਾਸਮਝੀ ਪ੍ਰਤੀ ਨਿਰਾਸ਼ਾ ਜਾਂ ਗੁੱਸਾ ਪ੍ਰਗਟ ਕਰਦਾ ਹੈ। ਇਹ ਸਿਰਫ਼ ਜਾਣਕਾਰੀ ਦੀ ਘਾਟ ਨਹੀਂ, ਬਲਕਿ ਸਧਾਰਨ ਸਮਝ ਜਾਂ ਸਹੀ ਸੋਚ ਦੀ ਘਾਟ ਨੂੰ ਦਰਸਾਉਂਦਾ ਹੈ।",
    "sound": "/wp-content/uploads/sound/akal_da_auna.mp3",
    "source": "Punjabi University Patiala",
    "g_enriched_definition_gurmukhi": "ਇਹ ਮੁਹਾਵਰਾ ਸ਼ਾਬਦਿਕ ਅਰਥਾਂ ਵਿੱਚ 'ਅਕਲ ਦਾ ਅੰਨ੍ਹਾ' ਭਾਵ ਬੁੱਧੀ ਜਾਂ ਸਮਝ ਪੱਖੋਂ ਅੰਨ੍ਹਾ ਹੋਣਾ ਦੱਸਦਾ ਹੈ। ਇਸਦਾ ਭਾਵ ਹੈ ਉਹ ਵਿਅਕਤੀ ਜਿਸ ਵਿੱਚ ਸੋਚਣ, ਸਮਝਣ ਅਤੇ ਸਹੀ ਨਿਰਣੇ ਲੈਣ ਦੀ ਸ਼ਕਤੀ ਦੀ ਘਾਟ ਹੋਵੇ। ਇਹ ਕਿਸੇ ਅਜਿਹੇ ਬੰਦੇ ਲਈ ਵਰਤਿਆ ਜਾਂਦਾ ਹੈ ਜੋ ਆਸਾਨੀ ਨਾਲ ਸਮਝ ਆਉਣ ਵਾਲੀਆਂ ਗੱਲਾਂ ਨੂੰ ਵੀ ਨਹੀਂ ਸਮਝਦਾ, ਮੂਰਖਤਾ ਭਰੇ ਕੰਮ ਕਰਦਾ ਹੈ, ਜਾਂ ਗਲਤ ਫੈਸਲੇ ਲੈਂਦਾ ਹੈ ਜਦੋਂ ਕਿ ਸਹੀ ਰਸਤਾ ਸਪੱਸ਼ਟ ਹੋਵੇ। ਇਹ ਸ਼ਬਦ ਆਮ ਤੌਰ 'ਤੇ ਨਕਾਰਾਤਮਕ ਤੌਰ 'ਤੇ ਵਰਤਿਆ ਜਾਂਦਾ ਹੈ ਅਤੇ ਕਿਸੇ ਦੀ ਬੇਵਕੂਫੀ ਜਾਂ ਨਾਸਮਝੀ ਪ੍ਰਤੀ ਨਿਰਾਸ਼ਾ ਜਾਂ ਗੁੱਸਾ ਪ੍ਰਗਟ ਕਰਦਾ ਹੈ। ਇਹ ਸਿਰਫ਼ ਜਾਣਕਾਰੀ ਦੀ ਘਾਟ ਨਹੀਂ, ਬਲਕਿ ਸਧਾਰਨ ਸਮਝ ਜਾਂ ਸਹੀ ਸੋਚ ਦੀ ਘਾਟ ਨੂੰ ਦਰਸਾਉਂਦਾ ਹੈ।",
    "g_example_sentence_gurmukhi": "ਮੈਂ ਉਹਨੂੰ ਕਿੰਨੀ ਵਾਰ ਸਮਝਾਇਆ ਕਿ ਇਹ ਕੰਮ ਇਦਾਂ ਨਹੀਂ ਕਰਨਾ, ਪਰ ਉਹ ਅਕਲ ਦਾ ਅੰਨ੍ਹਾ ਏ, ਫੇਰ ਉਹੀ ਗਲਤੀ ਕਰ ਬੈਠਾ।",
    "g_enriched_definition_english": "This idiom literally translates to 'blind of intellect' or 'blind of sense'. It is used to describe someone who is extremely stupid, foolish, or lacking in common sense and sound judgment. It implies a person who fails to understand simple things, makes obviously bad decisions, or acts foolishly even when the correct course of action is clear. It's not just about lack of knowledge, but a deficiency in applying one's mind or perceiving obvious truths, much like physical blindness prevents seeing the physical world. It's typically used as a derogatory term to express frustration or exasperation at someone's lack of intelligence or poor judgment. Equivalent Western concepts or phrases might include 'lacking common sense', 'thick as a brick', 'dense', 'obtuse', or someone who is 'intellectually blind' to the obvious.",
    "g_enriched_definition_shahmukhi": "ایہہ محاورہ لفظی معنیاں وچ 'عقل دا اَنھّا' مطلب بُدھی جاں سمجھ پکھوں اَنھّا ہونا دسدا اے۔ ایسدا مطلب اے اوہ بندا جہدے وچ سوچن، سمجھن تے صحیح فیصلے لین دی طاقت دی گھاٹ ہووے۔ ایہہ کسے اجیہے بندے لئی ورتیا جاندا اے جو سوکھیائی نال سمجھ آن والیاں گلاں نوں وی نہیں سمجھدا، بے وقوفی بھرے کم کردا اے، جاں غلط فیصلے لیندا اے جد کہ صحیح راہ واضع ہووے۔ ایہہ لفظ عام طور تے منفی طور تے ورتیا جاندا اے تے کسے دی بے وقوفی جاں ناسمجھی ول مایوسی جاں غصہ ظاہر کردا اے۔ ایہہ صرف معلومات دی گھاٹ نہیں، بلکہ سادھارن سمجھ جاں صحیح سوچ دی گھاٹ نوں درساؤندا اے۔"
  },
  {
    "id": 100011,
    "phrase_id": 300003,
    "phrase_gurmukhi": "ਅਕਲ ਦੁੜਾਉਣੀ",
    "synonyms_gurmukhi": "",
    "phrase_shahmukhi": "عقل دُڑاؤنی",
    "definition_english": "to think hard, deliberate, reflect on",
    "phrase_roman": "akal durauni",
    "phrase_roman_diacritics": "akal duṛāuṇī",
    "grammar": "phrase",
    "definition_gurmukhi": "ਕਿਸੇ ਮੁਸ਼ਕਿਲ ਸਵਾਲ, ਸਮੱਸਿਆ ਜਾਂ ਹਾਲਾਤ ਬਾਰੇ ਬਹੁਤ ਗੰਭੀਰਤਾ ਨਾਲ ਸੋਚਣਾ, ਵਿਚਾਰ ਕਰਨਾ, ਜਾਂ ਦਿਮਾਗ਼ ਲਾਉਣਾ। ਇਸਦਾ ਸ਼ਾਬਦਿਕ ਅਰਥ ਹੈ 'ਅਕਲ ਨੂੰ ਦੌੜਾਉਣਾ', ਭਾਵ ਦਿਮਾਗ਼ ਨੂੰ ਤੇਜ਼ੀ ਨਾਲ ਕੰਮ 'ਤੇ ਲਾਉਣਾ। ਇਹ ਮੁਹਾਵਰਾ ਉਦੋਂ ਵਰਤਿਆ ਜਾਂਦਾ ਹੈ ਜਦੋਂ ਕੋਈ ਵਿਅਕਤੀ ਕਿਸੇ ਗੁੰਝਲਦਾਰ ਚੀਜ਼ ਦਾ ਹੱਲ ਲੱਭਣ, ਕੋਈ ਯੋਜਨਾ ਬਣਾਉਣ, ਜਾਂ ਕਿਸੇ ਅਣਸੁਲਝੀ ਗੱਲ ਨੂੰ ਸਮਝਣ ਲਈ ਬਹੁਤ ਜ਼ਿਆਦਾ ਮਾਨਸਿਕ ਜ਼ੋਰ ਲਾ ਰਿਹਾ ਹੋਵੇ। ਇਹ ਡੂੰਘੀ ਸੋਚ ਜਾਂ ਰਣਨੀਤਕ ਵਿਚਾਰ ਨੂੰ ਦਰਸਾਉਂਦਾ ਹੈ ਜਿੱਥੇ ਆਸਾਨੀ ਨਾਲ ਹੱਲ ਨਾ ਮਿਲੇ।",
    "sound": "/wp-content/uploads/sound/akal_dadani.mp3",
    "source": "Punjabi University Patiala",
    "g_enriched_definition_gurmukhi": "ਕਿਸੇ ਮੁਸ਼ਕਿਲ ਸਵਾਲ, ਸਮੱਸਿਆ ਜਾਂ ਹਾਲਾਤ ਬਾਰੇ ਬਹੁਤ ਗੰਭੀਰਤਾ ਨਾਲ ਸੋਚਣਾ, ਵਿਚਾਰ ਕਰਨਾ, ਜਾਂ ਦਿਮਾਗ਼ ਲਾਉਣਾ। ਇਸਦਾ ਸ਼ਾਬਦਿਕ ਅਰਥ ਹੈ 'ਅਕਲ ਨੂੰ ਦੌੜਾਉਣਾ', ਭਾਵ ਦਿਮਾਗ਼ ਨੂੰ ਤੇਜ਼ੀ ਨਾਲ ਕੰਮ 'ਤੇ ਲਾਉਣਾ। ਇਹ ਮੁਹਾਵਰਾ ਉਦੋਂ ਵਰਤਿਆ ਜਾਂਦਾ ਹੈ ਜਦੋਂ ਕੋਈ ਵਿਅਕਤੀ ਕਿਸੇ ਗੁੰਝਲਦਾਰ ਚੀਜ਼ ਦਾ ਹੱਲ ਲੱਭਣ, ਕੋਈ ਯੋਜਨਾ ਬਣਾਉਣ, ਜਾਂ ਕਿਸੇ ਅਣਸੁਲਝੀ ਗੱਲ ਨੂੰ ਸਮਝਣ ਲਈ ਬਹੁਤ ਜ਼ਿਆਦਾ ਮਾਨਸਿਕ ਜ਼ੋਰ ਲਾ ਰਿਹਾ ਹੋਵੇ। ਇਹ ਡੂੰਘੀ ਸੋਚ ਜਾਂ ਰਣਨੀਤਕ ਵਿਚਾਰ ਨੂੰ ਦਰਸਾਉਂਦਾ ਹੈ ਜਿੱਥੇ ਆਸਾਨੀ ਨਾਲ ਹੱਲ ਨਾ ਮਿਲੇ।",
    "g_example_sentence_gurmukhi": "ਇਸ ਗੁੰਝਲਦਾਰ ਸਮੱਸਿਆ ਦਾ ਹੱਲ ਲੱਭਣ ਲਈ ਸਾਨੂੰ ਸਾਰਿਆਂ ਨੂੰ ਆਪਣੀ-ਆਪਣੀ **ਅਕਲ ਦੁੜਾਉਣੀ** ਪਵੇਗੀ।",
    "g_enriched_definition_english": "To think deeply, intensely, or to deliberate hard on a complex problem, question, or situation. Literally meaning 'to make the intellect run', it vividly describes the mind actively working or racing to find a solution or understand something. This idiom is used when someone is putting significant mental effort into figuring something out that isn't straightforward, brainstorming ideas, or pondering a difficult matter. It implies concentrated thought and often the need to 'rack one's brain' to arrive at an answer or plan. Equivalent Western phrases include 'to rack one's brain', 'to put on one's thinking cap', or 'to ponder deeply'.",
    "g_enriched_definition_shahmukhi": "کِسے مُشکل سوال، سمسیا یا حالات بارے بہُت گمبھیرتا نال سوچݨا، وِچار کرݨا، یا دماغ لاؤݨا۔ ایسدا ساہبدی اَرتھ ہے 'اَکل نُوں دوڑاؤݨا'، بھاویں دِماغ نُوں تیزی نال کمّ تے لاؤݨا۔ ایہہ مُہاورہ اُدّوں ورتیا جاندا ہے جدوں کوئی وِیَکتی کِسے گُمبھلدار چیز دا حلّ لبّھݨ، کوئی یوجنا بݨاؤݨ، یا کِسے اݨسُلجھی گلّ نُوں سمجھݨ لئی بہُت زیادہ مانسِک زور لا رہیا ہووے۔ ایہہ ڈونگھی سوچ یا رنّیتِک وِچار نُوں درساؤندا ہے جتّھے آسانی نال حلّ نہ مِلے۔"
  },
  {
    "id": 100139,
    "phrase_id": 300005,
    "phrase_gurmukhi": "ਅਚਿੰਤੇ ਬਾਜ਼ ਪੈਣੇ",
    "synonyms_gurmukhi": "",
    "phrase_shahmukhi": "اچِنتے باز پَینے",
    "definition_english": "sudden calamity, death (literally unexpected eagles)",
    "phrase_roman": "achinte baaz paine",
    "phrase_roman_diacritics": "acintē bāz paiṇē",
    "grammar": "phrase",
    "definition_gurmukhi": "ਇਸ ਮੁਹਾਵਰੇ ਦਾ ਸ਼ਾਬਦਿਕ ਅਰਥ ਹੈ \"ਅਚਾਨਕ ਬਾਜ਼ਾਂ ਦਾ ਪੈਣਾ\"। ਪਰ ਇਸਦਾ ਭਾਵ ਅਰਥ ਬਹੁਤ ਡੂੰਘਾ ਹੈ। ਬਾਜ਼ ਨੂੰ ਸ਼ਿਕਾਰੀ ਪੰਛੀ ਮੰਨਿਆ ਜਾਂਦਾ ਹੈ ਜੋ ਬਿਨਾਂ ਚੇਤਾਵਨੀ ਦੇ ਤੇਜ਼ੀ ਨਾਲ ਹਮਲਾ ਕਰਦਾ ਹੈ। \"ਅਚਿੰਤੇ ਬਾਜ਼ ਪੈਣੇ\" ਦਾ ਮਤਲਬ ਹੈ ਕੋਈ ਬਹੁਤ ਵੱਡੀ, ਅਚਾਨਕ ਅਤੇ ਬਿਨਾਂ ਕਿਸੇ ਤਿਆਰੀ ਦੇ ਆਉਣ ਵਾਲੀ ਮੁਸੀਬਤ ਜਾਂ ਬਿਪਤਾ ਦਾ ਸਾਹਮਣਾ ਕਰਨਾ। ਇਹ ਆਮ ਤੌਰ 'ਤੇ ਅਚਾਨਕ ਮੌਤ, ਕੋਈ ਵੱਡਾ ਹਾਦਸਾ, ਬਿਨਾਂ ਕਿਸੇ ਕਾਰਨ ਦੇ ਵੱਡਾ ਨੁਕਸਾਨ ਹੋ ਜਾਣਾ, ਜਾਂ ਜ਼ਿੰਦਗੀ ਵਿੱਚ ਕੋਈ ਅਜਿਹਾ ਭਿਆਨਕ ਮੋੜ ਆਉਣਾ ਦਰਸਾਉਂਦਾ ਹੈ ਜਿਸਦੀ ਕਦੇ ਕਲਪਨਾ ਵੀ ਨਾ ਕੀਤੀ ਹੋਵੇ। ਇਹ ਹਾਲਤ ਬੇਬਸੀ ਅਤੇ ਸਦਮੇ ਵਾਲੀ ਹੁੰਦੀ ਹੈ, ਜਿਵੇਂ ਕੋਈ ਅਚਾਨਕ ਸ਼ਿਕਾਰੀ ਦੇ ਚੁੰਗਲ ਵਿੱਚ ਆ ਜਾਵੇ। ਇਹ ਕਿਸੇ ਵੀ ਕਿਸਮ ਦੇ ਗੰਭੀਰ ਸੰਕਟ ਲਈ ਵਰਤਿਆ ਜਾਂਦਾ ਹੈ ਜੋ ਅਚਾਨਕ ਵਾਪਰੇ।",
    "sound": "/wp-content/uploads/sound/achintebaj_pene.mp3",
    "source": "Punjabi University Patiala",
    "g_enriched_definition_gurmukhi": "ਇਸ ਮੁਹਾਵਰੇ ਦਾ ਸ਼ਾਬਦਿਕ ਅਰਥ ਹੈ \"ਅਚਾਨਕ ਬਾਜ਼ਾਂ ਦਾ ਪੈਣਾ\"। ਪਰ ਇਸਦਾ ਭਾਵ ਅਰਥ ਬਹੁਤ ਡੂੰਘਾ ਹੈ। ਬਾਜ਼ ਨੂੰ ਸ਼ਿਕਾਰੀ ਪੰਛੀ ਮੰਨਿਆ ਜਾਂਦਾ ਹੈ ਜੋ ਬਿਨਾਂ ਚੇਤਾਵਨੀ ਦੇ ਤੇਜ਼ੀ ਨਾਲ ਹਮਲਾ ਕਰਦਾ ਹੈ। \"ਅਚਿੰਤੇ ਬਾਜ਼ ਪੈਣੇ\" ਦਾ ਮਤਲਬ ਹੈ ਕੋਈ ਬਹੁਤ ਵੱਡੀ, ਅਚਾਨਕ ਅਤੇ ਬਿਨਾਂ ਕਿਸੇ ਤਿਆਰੀ ਦੇ ਆਉਣ ਵਾਲੀ ਮੁਸੀਬਤ ਜਾਂ ਬਿਪਤਾ ਦਾ ਸਾਹਮਣਾ ਕਰਨਾ। ਇਹ ਆਮ ਤੌਰ 'ਤੇ ਅਚਾਨਕ ਮੌਤ, ਕੋਈ ਵੱਡਾ ਹਾਦਸਾ, ਬਿਨਾਂ ਕਿਸੇ ਕਾਰਨ ਦੇ ਵੱਡਾ ਨੁਕਸਾਨ ਹੋ ਜਾਣਾ, ਜਾਂ ਜ਼ਿੰਦਗੀ ਵਿੱਚ ਕੋਈ ਅਜਿਹਾ ਭਿਆਨਕ ਮੋੜ ਆਉਣਾ ਦਰਸਾਉਂਦਾ ਹੈ ਜਿਸਦੀ ਕਦੇ ਕਲਪਨਾ ਵੀ ਨਾ ਕੀਤੀ ਹੋਵੇ। ਇਹ ਹਾਲਤ ਬੇਬਸੀ ਅਤੇ ਸਦਮੇ ਵਾਲੀ ਹੁੰਦੀ ਹੈ, ਜਿਵੇਂ ਕੋਈ ਅਚਾਨਕ ਸ਼ਿਕਾਰੀ ਦੇ ਚੁੰਗਲ ਵਿੱਚ ਆ ਜਾਵੇ। ਇਹ ਕਿਸੇ ਵੀ ਕਿਸਮ ਦੇ ਗੰਭੀਰ ਸੰਕਟ ਲਈ ਵਰਤਿਆ ਜਾਂਦਾ ਹੈ ਜੋ ਅਚਾਨਕ ਵਾਪਰੇ।",
    "g_example_sentence_gurmukhi": "ਕੱਲ੍ਹ ਤੱਕ ਤਾਂ ਸਿਹਤ ਠੀਕ ਸੀ, ਪਰ ਅੱਜ ਅਚਾਨਕ ਚਲਾਣਾ ਕਰ ਗਿਆ, ਇੰਝ ਲੱਗਿਆ ਜਿਵੇਂ ਅਚਿੰਤੇ ਬਾਜ਼ ਪੈ ਗਏ ਹੋਣ।",
    "g_enriched_definition_english": "The literal translation of this idiom is \"unexpected eagles falling.\" Figuratively, it refers to a sudden, severe, and unforeseen calamity, crisis, or tragedy. The metaphor of the eagle, a bird of prey known for its swift and unpredicted attack, signifies a disaster that strikes without warning and from which there is little defense. The 'unexpected' aspect emphasizes the lack of any prior indication or preparation for the event. This idiom is commonly used to describe life-altering negative events such as sudden death, a catastrophic accident, major unexpected financial ruin, or any profound personal disaster that occurs without warning. It conveys a feeling of being blindsided, helpless, and overwhelmed by the suddenness and magnitude of the misfortune. Equivalent Western phrases include \"a bolt from the blue,\" \"stricken by tragedy,\" or being \"blindsided by disaster.\"",
    "g_enriched_definition_shahmukhi": "ایس محاورے دا لفظی مطلب اے \"اچانک بازاں دا پینا\"۔ پر ایدا بھاوَ ارتھ بہت ڈونگھا اے۔ باز نوں شکاری پرندہ منیا جاندا اے جیہڑا بناں چیتونی دے تیزی نال حملہ کردا اے۔ \"اچنتے باز پینے\" دا مطلب اے کوئی بہت وڈی، اچانک تے بناں کسے تیاری دے آؤن والی مصیبت یا بلا دا ساہمنا کرنا۔ ایہہ عام طور تے اچانک موت، کوئی وڈا حادثہ، بناں کسے وجہ دے وڈا نقصان ہو جانا، یا زندگی وچ کوئی ایہو جیہا خوفناک موڑ آؤنا دسدا اے جیدے بارے کدی سوچیا وی نہ ہووے۔ ایہہ حالت بے بسی تے صدمے والی ہوندی اے، جیویں کوئی اچانک شکاری دے چنگل وچ آ جائے۔ ایہہ کسے وی قسم دے گمبھیر سنکٹ لئی ورتیا جاندا اے جیہڑا اچانک ہووے۔"
  },
  {
    "id": 100261,
    "phrase_id": 300006,
    "phrase_gurmukhi": "ਅਡੰਬਰ ਕਰਨਾ",
    "synonyms_gurmukhi": "ਅਡੰਬਰ ਰਚਣਾ",
    "phrase_shahmukhi": "اَڈنبر کرنا اَڈنبر رچنا",
    "definition_english": "to hold or organise ਅਡੰਬਰ",
    "phrase_roman": "adambar karnaa adambar rachnaa",
    "phrase_roman_diacritics": "aḍaṁbar karanā aḍaṁbar racṇā",
    "grammar": "phrase",
    "definition_gurmukhi": "ਅਡੰਬਰ ਕਰਨਾ ਦਾ ਮਤਲਬ ਹੈ ਕਿਸੇ ਚੀਜ਼ ਦਾ ਬਹੁਤ ਜ਼ਿਆਦਾ ਦਿਖਾਵਾ ਕਰਨਾ, ਸ਼ਾਨੋ-ਸ਼ੌਕਤ ਦਿਖਾਉਣੀ, ਜਾਂ ਕੋਈ ਪ੍ਰਬੰਧ ਇਸ ਤਰ੍ਹਾਂ ਕਰਨਾ ਜਿਸ ਵਿੱਚ ਅਸਲੀਅਤ ਨਾਲੋਂ ਜ਼ਿਆਦਾ ਨੁਮਾਇਸ਼ ਹੋਵੇ। ਇਹ ਅਕਸਰ ਕਿਸੇ ਮਾਮੂਲੀ ਗੱਲ ਨੂੰ ਵੱਡਾ ਚੜ੍ਹਾ ਕੇ ਪੇਸ਼ ਕਰਨ, ਜਾਂ ਨਿਰੋਲ ਦਿਖਾਵੇ ਲਈ ਬੇਲੋੜਾ ਖਰਚ ਜਾਂ ਰੌਲਾ-ਰੱਪਾ ਪਾਉਣ ਦੇ ਸੰਦਰਭ ਵਿੱਚ ਵਰਤਿਆ ਜਾਂਦਾ ਹੈ। ਪੰਜਾਬੀ ਸੱਭਿਆਚਾਰ ਵਿੱਚ, ਜਿੱਥੇ ਮਿਲਵਰਤਣ ਅਤੇ ਮੇਲ-ਜੋਲ ਨੂੰ ਅਹਿਮੀਅਤ ਦਿੱਦੀ ਜਾਂਦੀ ਹੈ, ਉੱਥੇ ਫੋਕੇ ਦਿਖਾਵੇ ਅਤੇ ਬੇਲੋੜੇ ਅਡੰਬਰ ਨੂੰ ਨਾਪਸੰਦ ਕੀਤਾ ਜਾਂਦਾ ਹੈ। ਇਹ ਮੁਹਾਵਰਾ ਅਜਿਹੇ ਵਿਹਾਰ ਦੀ ਆਲੋਚਨਾ ਕਰਨ ਲਈ ਵਰਤਿਆ ਜਾਂਦਾ ਹੈ ਜਿੱਥੇ ਸਾਰਾ ਜ਼ੋਰ ਸਿਰਫ਼ ਬਾਹਰੀ ਦਿਖਾਵੇ 'ਤੇ ਹੋਵੇ, ਭਾਵੇਂ ਉਸ ਦੇ ਪਿੱਛੇ ਕੋਈ ਠੋਸ ਕਾਰਨ ਜਾਂ ਸਾਰਥਕਤਾ ਨਾ ਹੋਵੇ। ਇਸ ਵਿੱਚ 'ਪਾਖੰਡ' ਜਾਂ 'ਬਣਾਵਟ' ਦਾ ਭਾਵ ਵੀ ਸ਼ਾਮਲ ਹੋ ਸਕਦਾ ਹੈ।",
    "sound": "/wp-content/uploads/sound/adambar_karna.mp3",
    "source": "Punjabi University Patiala",
    "g_enriched_definition_gurmukhi": "ਅਡੰਬਰ ਕਰਨਾ ਦਾ ਮਤਲਬ ਹੈ ਕਿਸੇ ਚੀਜ਼ ਦਾ ਬਹੁਤ ਜ਼ਿਆਦਾ ਦਿਖਾਵਾ ਕਰਨਾ, ਸ਼ਾਨੋ-ਸ਼ੌਕਤ ਦਿਖਾਉਣੀ, ਜਾਂ ਕੋਈ ਪ੍ਰਬੰਧ ਇਸ ਤਰ੍ਹਾਂ ਕਰਨਾ ਜਿਸ ਵਿੱਚ ਅਸਲੀਅਤ ਨਾਲੋਂ ਜ਼ਿਆਦਾ ਨੁਮਾਇਸ਼ ਹੋਵੇ। ਇਹ ਅਕਸਰ ਕਿਸੇ ਮਾਮੂਲੀ ਗੱਲ ਨੂੰ ਵੱਡਾ ਚੜ੍ਹਾ ਕੇ ਪੇਸ਼ ਕਰਨ, ਜਾਂ ਨਿਰੋਲ ਦਿਖਾਵੇ ਲਈ ਬੇਲੋੜਾ ਖਰਚ ਜਾਂ ਰੌਲਾ-ਰੱਪਾ ਪਾਉਣ ਦੇ ਸੰਦਰਭ ਵਿੱਚ ਵਰਤਿਆ ਜਾਂਦਾ ਹੈ। ਪੰਜਾਬੀ ਸੱਭਿਆਚਾਰ ਵਿੱਚ, ਜਿੱਥੇ ਮਿਲਵਰਤਣ ਅਤੇ ਮੇਲ-ਜੋਲ ਨੂੰ ਅਹਿਮੀਅਤ ਦਿੱਦੀ ਜਾਂਦੀ ਹੈ, ਉੱਥੇ ਫੋਕੇ ਦਿਖਾਵੇ ਅਤੇ ਬੇਲੋੜੇ ਅਡੰਬਰ ਨੂੰ ਨਾਪਸੰਦ ਕੀਤਾ ਜਾਂਦਾ ਹੈ। ਇਹ ਮੁਹਾਵਰਾ ਅਜਿਹੇ ਵਿਹਾਰ ਦੀ ਆਲੋਚਨਾ ਕਰਨ ਲਈ ਵਰਤਿਆ ਜਾਂਦਾ ਹੈ ਜਿੱਥੇ ਸਾਰਾ ਜ਼ੋਰ ਸਿਰਫ਼ ਬਾਹਰੀ ਦਿਖਾਵੇ 'ਤੇ ਹੋਵੇ, ਭਾਵੇਂ ਉਸ ਦੇ ਪਿੱਛੇ ਕੋਈ ਠੋਸ ਕਾਰਨ ਜਾਂ ਸਾਰਥਕਤਾ ਨਾ ਹੋਵੇ। ਇਸ ਵਿੱਚ 'ਪਾਖੰਡ' ਜਾਂ 'ਬਣਾਵਟ' ਦਾ ਭਾਵ ਵੀ ਸ਼ਾਮਲ ਹੋ ਸਕਦਾ ਹੈ।",
    "g_example_sentence_gurmukhi": "ਅੱਜ ਕੱਲ੍ਹ ਕਈ ਲੋਕ ਸ਼ਾਦੀਆਂ 'ਤੇ ਬਹੁਤ ਅਡੰਬਰ ਕਰਦੇ ਹਨ, ਜਦੋਂ ਕਿ ਸਾਦਗੀ ਵਿੱਚ ਵੀ ਖੁਸ਼ੀ ਮਿਲ ਸਕਦੀ ਹੈ।",
    "g_enriched_definition_english": "The idiom \"ਅਡੰਬਰ ਕਰਨਾ\" (Adambar karna) means to create or engage in excessive display, showiness, or ostentation. It refers to the act of putting on a big show, often for superficial reasons, or making elaborate arrangements that prioritize outward appearance over substance or genuine need. It is commonly used to describe exaggerating a minor matter, or creating unnecessary fuss, expense, or commotion purely for the sake of showing off. In Punjabi culture, while warmth and hospitality are valued, excessive, insincere, or wasteful displays are often frowned upon. This idiom is used to critique behavior where the focus is solely on external show, even if there's no solid reason or meaning behind it. It can also carry connotations of pretense or artificiality. Equivalent Western phrases might include 'to put on a show,' 'to make a big display,' or 'to engage in ostentation,' often implying criticism.",
    "g_enriched_definition_shahmukhi": "اڈمبر کرنا دا مطلب اے کسے چیز دا بہت زیادہ دکھاوا کرنا، شان و شوکت وکھاؤنی، یا کوئی پربندھ اس طرحاں کرنا جس وچ اصلیت نالوں زیادہ نمائش ہووے۔ ایہہ اکثر کسے معمولی گل نوں وڈا چڑھا کے پیش کرن، یا نرول دکھاوے لئی بے لوڑا خرچ یا رولا رپا پاؤن دے سندربھ وچ ورتیا جاندا اے۔ پنجابی سبھیاچار وچ، جتھے ملو ورتن اتے میل جول نوں اہمیت دتی جاندی اے، اتھے پھوکے دکھاوے اتے بے لوڑے اڈمبر نوں ناپسند کیتا جاندا اے۔ ایہہ محاورہ اجیہے وہار دی آلوچنا کرن لئی ورتیا جاندا اے جتھے سارا زور صرف باہری دکھاوے تے ہووے، بھاویں اس دے پچھے کوئی ٹھوس کارن یا سارتھکتا نہ ہووے۔ اس وچ 'پاکھنڈ' یا 'بناوٹ' دا بھاو وی شامل ہو سکدا اے۔"
  },
  {
    "id": 100353,
    "phrase_id": 300007,
    "phrase_gurmukhi": "ਅਧਕ ਦੀ ਕਿਰਿਆ",
    "synonyms_gurmukhi": "",
    "phrase_shahmukhi": "ادھک دی کِریا",
    "definition_english": "gemination",
    "phrase_roman": "adhak di kiria",
    "phrase_roman_diacritics": "aḏhak dī kiriā",
    "grammar": "phrase",
    "definition_gurmukhi": "ਅਧਕ (ੱ) ਗੁਰਮੁਖੀ ਲਿਪੀ ਵਿੱਚ ਵਰਤੀ ਜਾਣ ਵਾਲੀ ਇੱਕ ਲਗ ਹੈ ਜੋ ਕਿਸੇ ਅੱਖਰ ਦੇ ਉੱਪਰ ਲੱਗਦੀ ਹੈ। 'ਅਧਕ ਦੀ ਕਿਰਿਆ' ਤੋਂ ਭਾਵ ਹੈ ਇਸ ਲਗ ਦਾ ਕੰਮ ਜਾਂ ਪ੍ਰਭਾਵ। ਅਧਕ ਦੀ ਮੁੱਖ ਕਿਰਿਆ ਇਹ ਹੈ ਕਿ ਇਹ ਆਪਣੇ ਤੋਂ ਅਗਲੇ ਵਿਅੰਜਨ ਨੂੰ ਦੁੱਤ (ਦੋਹਰਾ) ਕਰ ਦਿੰਦੀ ਹੈ। ਇਸ ਨਾਲ ਉਸ ਵਿਅੰਜਨ ਦੀ ਆਵਾਜ਼ ਦਾ ਉਚਾਰਨ ਲੰਬਾ, ਜ਼ੋਰਦਾਰ ਜਾਂ ਦਬਾਅ ਵਾਲਾ ਹੋ ਜਾਂਦਾ ਹੈ। ਇਹ ਸ਼ਬਦਾਂ ਦੇ ਸਹੀ ਉਚਾਰਨ ਅਤੇ ਅਰਥਾਂ ਦੇ ਫ਼ਰਕ ਨੂੰ ਸਪੱਸ਼ਟ ਕਰਨ ਲਈ ਬਹੁਤ ਮਹੱਤਵਪੂਰਨ ਹੈ (ਜਿਵੇਂ 'ਸੱਟ' ਅਤੇ 'ਸਟ')। ਇਹ ਮੁੱਖ ਤੌਰ 'ਤੇ ਪੰਜਾਬੀ ਵਿਆਕਰਨ ਅਤੇ ਫੋਨੈਟਿਕਸ (ਧੁਨੀ ਵਿਗਿਆਨ) ਦਾ ਤਕਨੀਕੀ ਸੰਕਲਪ ਹੈ, ਜਿਸਦੀ ਵਰਤੋਂ ਭਾਸ਼ਾ ਸਿਖਾਉਣ ਜਾਂ ਵਿਆਕਰਨ ਦੀ ਚਰਚਾ ਕਰਨ ਵੇਲੇ ਹੁੰਦੀ ਹੈ, ਨਾ ਕਿ ਇਹ ਆਮ ਬੋਲਚਾਲ ਦਾ ਮੁਹਾਵਰਾ ਹੈ।",
    "sound": "/wp-content/uploads/sound/adak_di_kriya.mp3",
    "source": "Punjabi University Patiala",
    "g_enriched_definition_gurmukhi": "ਅਧਕ (ੱ) ਗੁਰਮੁਖੀ ਲਿਪੀ ਵਿੱਚ ਵਰਤੀ ਜਾਣ ਵਾਲੀ ਇੱਕ ਲਗ ਹੈ ਜੋ ਕਿਸੇ ਅੱਖਰ ਦੇ ਉੱਪਰ ਲੱਗਦੀ ਹੈ। 'ਅਧਕ ਦੀ ਕਿਰਿਆ' ਤੋਂ ਭਾਵ ਹੈ ਇਸ ਲਗ ਦਾ ਕੰਮ ਜਾਂ ਪ੍ਰਭਾਵ। ਅਧਕ ਦੀ ਮੁੱਖ ਕਿਰਿਆ ਇਹ ਹੈ ਕਿ ਇਹ ਆਪਣੇ ਤੋਂ ਅਗਲੇ ਵਿਅੰਜਨ ਨੂੰ ਦੁੱਤ (ਦੋਹਰਾ) ਕਰ ਦਿੰਦੀ ਹੈ। ਇਸ ਨਾਲ ਉਸ ਵਿਅੰਜਨ ਦੀ ਆਵਾਜ਼ ਦਾ ਉਚਾਰਨ ਲੰਬਾ, ਜ਼ੋਰਦਾਰ ਜਾਂ ਦਬਾਅ ਵਾਲਾ ਹੋ ਜਾਂਦਾ ਹੈ। ਇਹ ਸ਼ਬਦਾਂ ਦੇ ਸਹੀ ਉਚਾਰਨ ਅਤੇ ਅਰਥਾਂ ਦੇ ਫ਼ਰਕ ਨੂੰ ਸਪੱਸ਼ਟ ਕਰਨ ਲਈ ਬਹੁਤ ਮਹੱਤਵਪੂਰਨ ਹੈ (ਜਿਵੇਂ 'ਸੱਟ' ਅਤੇ 'ਸਟ')। ਇਹ ਮੁੱਖ ਤੌਰ 'ਤੇ ਪੰਜਾਬੀ ਵਿਆਕਰਨ ਅਤੇ ਫੋਨੈਟਿਕਸ (ਧੁਨੀ ਵਿਗਿਆਨ) ਦਾ ਤਕਨੀਕੀ ਸੰਕਲਪ ਹੈ, ਜਿਸਦੀ ਵਰਤੋਂ ਭਾਸ਼ਾ ਸਿਖਾਉਣ ਜਾਂ ਵਿਆਕਰਨ ਦੀ ਚਰਚਾ ਕਰਨ ਵੇਲੇ ਹੁੰਦੀ ਹੈ, ਨਾ ਕਿ ਇਹ ਆਮ ਬੋਲਚਾਲ ਦਾ ਮੁਹਾਵਰਾ ਹੈ।",
    "g_example_sentence_gurmukhi": "'ਪੱਤਾ' ਸ਼ਬਦ ਵਿੱਚ 'ਪ' ਉੱਤੇ ਲੱਗਾ ਅਧਕ, 'ਤ' ਅੱਖਰ ਉੱਤੇ ਅਧਕ ਦੀ ਕਿਰਿਆ ਕਰਦਾ ਹੈ, ਜਿਸ ਕਾਰਨ 'ਤ' ਦਾ ਉਚਾਰਨ ਦੋਹਰਾ ਹੋ ਜਾਂਦਾ ਹੈ।",
    "g_enriched_definition_english": "'ਅਧਕ ਦੀ ਕਿਰਿਆ' (Adhak di kiria) literally translates to \"the action or process of the Adhak\". Adhak (ੱ) is a diacritical mark used in the Gurmukhi script, placed above a consonant. The 'ਕਿਰਿਆ' (action or function) of the Adhak is to indicate that the *following* consonant should be geminated or doubled in pronunciation. This causes the sound of that subsequent consonant to be longer, stronger, or stressed. It is crucial for correct pronunciation and differentiating between words that might otherwise sound similar (e.g., 'ਸੱਟ' (saṭṭ - injury) vs. 'ਸਟ' (saṭ - a movement)). This phrase is primarily a technical concept used in Punjabi grammar and phonetics, particularly in language teaching and linguistic discussions, rather than a common idiomatic expression used in everyday conversation. As it relates to a specific orthographic feature of Gurmukhi, there are no direct equivalent idiomatic phrases in Western languages.",
    "g_enriched_definition_shahmukhi": "ادھک (ّ) گرمکھی لپی وچ ورتی جان والی اک لَگ اے جیہڑی کسے اکھر دے اُتے لگدی اے۔ 'ادھک دی کِریا' توں بھاوَ اے ایس لگ دا کم یا پربھاوَ۔ ادھک دی مُکھ کِریا ایہہ اے کہ ایہہ اپنے توں اگلے وئنجن نوں دت (دوہرا) کر دیندی اے۔ ایس نال اوس وئنجن دی آواز دا اچارن لمبا، زوردار یا دباؤ والا ہو جاندا اے۔ ایہہ لفظاں دے صحیح اچارن تے ارتھاں دے فرق نوں سپّشٹ کرن لئی بوہت مہتوَ پورن اے (جویں 'سٹّ' اتے 'سٹ')۔ ایہہ مُکھ طور تے پنجابی ویاکرن اتے فوناٹکس (دھنی وگیان) دا تکنیکی سنکلپ اے، جسدی ورتوں بھاشا سکھاون یا ویاکرن دی چرچہ کرن ویلے ہوندی اے، نہ کہ ایہہ عام بول چال دا محاورہ اے۔"
  }
]